app/controllers/movies_controller.rb

INSERT INTO "movies" ("name", "rating", "description", "user_id", "release_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "description" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["description", "Mucho bão IIdssds"], ["updated_at", "2017-02-24 11:49:56.887920"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)