app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["email", "atorresleticia2@gmail.com"]]
---
  def create
  	user = User.where(:email => params[:session][:email].downcase).first